Tekla.Structures.DirectManipulation.Adapter.Picker.PickerConfigurationExtensions.DotPickType
The Tekla.Structures.DirectManipulation.Adapter.Picker.PickerConfigurationExtensions.DotPickType enum represents the values
assignable to Tekla.Structures.ModelInternal.dotUIPicker_t.PickType.

Tekla.Structures.DirectManipulation.Adapter.Picker.PickerConfigurationExtensions.DotPickType.Geometry
The picker targets geometry.

Tekla.Structures.DirectManipulation.Adapter.Picker.PickerConfigurationExtensions.DotPickType.Object
The picker targets objects.